devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
        #if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
        if (major == _I2C1 && minor >= _I2C1_NUMBER_OF_DEVICES) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }
        #endif

        #if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
        if (major == _I2C2 && minor >= _I2C2_NUMBER_OF_DEVICES) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }
        #endif


        /* creates basic module structures */
        if (I2C == NULL) {
                I2C = calloc(1, sizeof(I2C_mem_t));
                if (!I2C) {
                        goto error;
                }
        }

        if (I2C->periph[major].lock == NULL) {
                I2C->periph[major].lock  = _sys_mutex_new(MUTEX_NORMAL);
                if (!I2C->periph[major].lock) {
                        goto error;
                }
        }

        if (I2C->periph[major].event == NULL) {
                I2C->periph[major].event = _sys_semaphore_new(1, 0);
                if (!I2C->periph[major].event) {
                        goto error;
                }
        }

        if (I2C->periph[major].initialized == false) {
                if (!enable_I2C(major)) {
                        goto error;
                }
        }


        /* creates device structure */
        I2C_dev_t *hdl = calloc(1, sizeof(I2C_dev_t));
        if (hdl) {
                hdl->config  = &I2C_cfg[major].devices[minor];
                hdl->address =  I2C_cfg[major].devices[minor].addr;
                I2C->periph[major].dev_cnt++;
                *device_handle = hdl;
                return STD_RET_OK;
        }


        /* error handling */
        error:
        release_resources(major);
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_RELEASE(I2C, void *device_handle)
{
        I2C_dev_t *hdl = device_handle;
        stdret_t status;

        _sys_critical_section_begin();

        if (_sys_device_is_unlocked(&hdl->lock)) {

                I2C->periph[hdl->config->major].dev_cnt--;
                release_resources(hdl->config->major);
                free(hdl);

                status = STD_RET_OK;
        } else {
                errno  = EBUSY;
                status = STD_RET_ERROR;
        }

        _sys_critical_section_end();

        return status;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_OPEN(I2C, void *device_handle, vfs_open_flags_t flags)
{
        UNUSED_ARG(flags);

        I2C_dev_t *hdl = device_handle;

        return _sys_device_lock(&hdl->lock) ? STD_RET_OK : STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_CLOSE(I2C, void *device_handle, bool force)
{
        I2C_dev_t *hdl = device_handle;

        if (_sys_device_is_access_granted(&hdl->lock) || force) {
                _sys_device_unlock(&hdl->lock, force);
                return STD_RET_OK;
        } else {
                errno = EBUSY;
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of written bytes, -1 if error
 */
//==============================================================================
API_MOD_WRITE(I2C, void *device_handle, const u8_t *src, size_t count, fpos_t *fpos, struct vfs_fattr fattr)
{
        UNUSED_ARG(fattr);

        I2C_dev_t *hdl = device_handle;

        ssize_t n = -1;

        if (_sys_mutex_lock(I2C->periph[hdl->config->major].lock, access_timeout)) {
//                        n = I2C_transmit(hdl, true, *fpos, src, count, true);
                _sys_mutex_unlock(I2C->periph[hdl->config->major].lock);
        } else {
                errno = ETIME;
        }

        return n;
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[in ]           fattr                  file attributes
 *
 * @return number of read bytes, -1 if error
 */
//==============================================================================
API_MOD_READ(I2C, void *device_handle, u8_t *dst, size_t count, fpos_t *fpos, struct vfs_fattr fattr)
{
        UNUSED_ARG(fattr);

        I2C_dev_t *hdl = device_handle;

        ssize_t n = -1;

        if (_sys_mutex_lock(I2C->periph[hdl->config->major].lock, access_timeout)) {

                if (hdl->config->sub_addr_mode != I2C_SUB_ADDR_MODE__DISABLED) {
                        if (!start(hdl))
                                goto error;

                        if (!send_address_7bit(hdl, true))
                                goto error;
                        else
                                clear_send_address_7bit_event(hdl);

                        if (!send_subaddress(hdl, *fpos, hdl->config->sub_addr_mode))
                                goto error;
                }

