devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
        u16_t CCR;
        if (cfg->freq <= 100000) {
                CCR = ((1000000/(2 * cfg->freq)) * clocks.PCLK1_Frequency) & I2C_CCR_CCR;
        } else if (cfg->freq < 400000){
                CCR  = ((10000000/(3 * cfg->freq)) * clocks.PCLK1_Frequency / 10) & I2C_CCR_CCR;
                CCR |= I2C_CCR_FS;
        } else {
                CCR  = ((100000000/(25 * cfg->freq)) * clocks.PCLK1_Frequency / 100 + 1) & I2C_CCR_CCR;
                CCR |= I2C_CCR_FS | I2C_CCR_DUTY;
        }

        i2c->CR1   = I2C_CR1_SWRST;
        i2c->CR1   = 0;
        i2c->CR2   = CR2;
        i2c->CCR   = CCR;
        i2c->TRISE = clocks.PCLK1_Frequency + 1;
        i2c->CR1   = I2C_CR1_PE;

        I2C->periph[major].initialized = true;

        return true;
}

//==============================================================================
/**
 * @brief  Disables selected I2C peripheral
 * @param  major        I2C peripheral number
 * @return None
 */
//==============================================================================
static void disable_I2C(u8_t major)
{
        const I2C_config_t *cfg = &I2C_cfg[major];
        I2C_t              *i2c = const_cast(I2C_t*, I2C_cfg[major].I2C);

        #if (_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0)
        if (cfg->use_DMA) {
                NVIC_DisableIRQ(cfg->DMA_tx_IRQ_n);
                NVIC_DisableIRQ(cfg->DMA_rx_IRQ_n);

                DMA_Channel_t *DMA_rx = const_cast(DMA_Channel_t*, cfg->DMA_rx);
                DMA_Channel_t *DMA_tx = const_cast(DMA_Channel_t*, cfg->DMA_tx);

                DMA_rx->CCR = 0;
                DMA_tx->CCR = 0;
        }
        #endif

        NVIC_DisableIRQ(cfg->IRQ_EV_n);
        NVIC_DisableIRQ(cfg->IRQ_ER_n);

        WRITE_REG(i2c->CR1, 0);
        SET_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        CLEAR_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        CLEAR_BIT(RCC->APB1ENR, cfg->APB1ENR_clk_mask);

        I2C->periph[major].initialized = false;
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static void error(I2C_dev_t *hdl)
{
        errno = EIO;

        CLEAR_BIT(get_I2C(hdl)->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN);

        u8_t tmp = get_I2C(hdl)->SR1;
             tmp = get_I2C(hdl)->SR2;
             tmp = get_I2C(hdl)->DR;
             tmp = get_I2C(hdl)->DR;
        (void) tmp;

        stop(hdl);

        enable_I2C(hdl->config->major);
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static bool wait_for_event(I2C_dev_t *hdl, u16_t SR1_event_mask)
{
        I2C->periph[hdl->config->major].SR1_mask = SR1_event_mask & 0xDF;
        I2C->periph[hdl->config->major].error    = false;

        u16_t CR2 = I2C_CR2_ITEVTEN | I2C_CR2_ITERREN;
        if (SR1_event_mask & (I2C_SR1_RXNE | I2C_SR1_TXE)) {
                CR2 |= I2C_CR2_ITBUFEN;
        }

        SET_BIT(get_I2C(hdl)->CR2, CR2);

        if (_sys_semaphore_wait(I2C->periph[hdl->config->major].event, device_timeout)) {
                if (I2C->periph[hdl->config->major].error == false) {
                        return true;
                }
        }

        error(hdl);
        return false;
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static bool start(I2C_dev_t *hdl)
{
        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);
        return wait_for_event(hdl, I2C_SR1_SB);
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static void stop(I2C_dev_t *hdl)
{
        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_STOP);
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static bool send_address_7bit(I2C_dev_t *hdl, bool write)
{
        get_I2C(hdl)->DR = write ? hdl->address & 0xFE : hdl->address | 0x01;
        return wait_for_event(hdl, I2C_SR1_ADDR);
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static void clear_send_address_7bit_event(I2C_dev_t *hdl)
{
        I2C_t *i2c = get_I2C(hdl);

        _sys_critical_section_begin();
        u16_t tmp;
        tmp = i2c->SR1;
        tmp = i2c->SR2;
        (void)tmp;
        _sys_critical_section_end();
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static bool send_subaddress(I2C_dev_t *hdl, u32_t address, I2C_sub_addr_mode_t mode)
{
        I2C_t *i2c = get_I2C(hdl);

        switch (mode) {
        case I2C_SUB_ADDR_MODE__3_BYTES:
                i2c->DR = address >> 16;
                if (!wait_for_event(hdl, I2C_SR1_BTF))
                        break;
                // if there is no error then send next bytes

        case I2C_SUB_ADDR_MODE__2_BYTES:
                i2c->DR = address >> 8;
                if (!wait_for_event(hdl, I2C_SR1_BTF))
                        break;
                // if there is no error then send next bytes

        case I2C_SUB_ADDR_MODE__1_BYTE:
                i2c->DR = address & 0xFF;
                return wait_for_event(hdl, I2C_SR1_BTF);

        default:
                errno = EINVAL;
                return false;
        }

