devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
        return true;
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static void set_ACK_according_to_reception_size(I2C_dev_t *hdl, size_t count)
{
        I2C_t *i2c = get_I2C(hdl);

        if (count == 2) {
                SET_BIT(i2c->CR1, I2C_CR1_POS | I2C_CR1_ACK);
        } else {
                SET_BIT(i2c->CR1, I2C_CR1_ACK);
        }
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static ssize_t receive(I2C_dev_t *hdl, u8_t *dst, size_t count)
{
        ssize_t n = 0;

        I2C_t *i2c = get_I2C(hdl);

        if (count >= 3) {
                clear_send_address_7bit_event(hdl);

                while (count) {
                        if (count == 3) {
//                                while (!(i2c->SR1 & I2C_SR1_RXNE));
                                if (!wait_for_event(hdl, I2C_SR1_RXNE))
                                        break;

//                                while (!(i2c->SR1 & I2C_SR1_BTF));
                                if (!wait_for_event(hdl, I2C_SR1_BTF))
                                        break;

                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                *dst++ = i2c->DR;
                                n++;

//                                while (!(i2c->SR1 & I2C_SR1_RXNE));
                                if (!wait_for_event(hdl, I2C_SR1_RXNE))
                                        break;

                                stop(hdl);
                                *dst++ = i2c->DR;
                                n++;

//                                while (!(i2c->SR1 & I2C_SR1_RXNE));
                                if (!wait_for_event(hdl, I2C_SR1_RXNE))
                                        break;

                                *dst++ = i2c->DR;
                                n++;

                                count = 0;
                        } else {
//                                while (!(i2c->SR1 & I2C_SR1_RXNE));
                                if (wait_for_event(hdl, I2C_SR1_RXNE)) {
                                        *dst++ = i2c->DR;
                                        count--;
                                        n++;
                                } else {
                                        break;
                                }
                        }
                }

        } else if (count == 2) {
                _sys_critical_section_begin();
                clear_send_address_7bit_event(hdl);
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                _sys_critical_section_end();

                if (wait_for_event(hdl, I2C_SR1_BTF)) {
                        stop(hdl);

                        *dst++ = i2c->DR;
                        *dst++ = i2c->DR;
                        n     += 2;
                }

        } else if (count == 1) {
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                clear_send_address_7bit_event(hdl);
                stop(hdl);

                if (wait_for_event(hdl, I2C_SR1_RXNE)) {
                        *dst++ = i2c->DR;
                        n     += 1;
                }
        }

        return n;
}

//==============================================================================
/**
 * @brief  Waits for IRQ event
 * @param  hdl          device handle
 * @return On success true is returned, otherwise false and appropriate error is set
 */
//==============================================================================
//static bool wait_for_event(I2C_dev_t *hdl)
//{
//        I2C->periph[hdl->config->major].error = false;
//        SET_BIT(get_I2C(hdl)->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN);
//
//        if (!_sys_semaphore_wait(I2C->periph[hdl->config->major].event, device_timeout)) {
//                CLEAR_BIT(get_I2C(hdl)->CR2, I2C_CR2_ITERREN | I2C_CR2_ITBUFEN | I2C_CR2_ITEVTEN);
//                I2C->periph[hdl->config->major].error = true;
//                errno = ETIME;
//                return false;
//        }
//
//        if (I2C->periph[hdl->config->major].error) {
//                errno = EIO;
//                return false;
//        }
//
//        return true;
//}

//==============================================================================
/**
 * @brief  Configure IRQ's state machine to perform data transmission
 * @param  hdl                  device's handle
 * @param  sub_addr_mode        sub-address send enabled (details read from configuration)
 * @param  sub_addr             sub-address value
 * @param  src                  data source
 * @param  size                 size of data
 * @param  stop                 send STOP sequence after transaction (true)
 * @return On success returns number of transfered bytes, otherwise -1 and
 *         appropriate error is set
 */
//==============================================================================
//static ssize_t I2C_transmit(I2C_dev_t *hdl, bool sub_addr_mode, u32_t sub_addr, const u8_t *src, size_t size, bool stop)
//{
//        struct I2C_per *per = &I2C->periph[hdl->config->major];
//
//        per->data          = const_cast(u8_t*, src);
//        per->data_size     = size;
//        per->stop          = stop;
//        per->write         = true;
//        per->sub_addr      = sub_addr;
//        per->sub_addr_mode = sub_addr_mode ? hdl->config->sub_addr_mode : I2C_SUB_ADDR_MODE__DISABLED;
//        per->dev           = hdl;
//        per->state         = STATE_START;
//
//        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);
//
//        return wait_for_event(hdl) ? static_cast(ssize_t, size - per->data_size) : -1;
//}

//==============================================================================
/**
 * @brief  Configre IRQ's state machine to perform data reception
 * @param  hdl                  device's handle
 * @param  dst                  data destination buffer
 * @param  size                 number of bytes to read
 * @param  stop                 send STOP sequence after transaction (true)
 * @param  On success returns number of received bytes, otherwise -1 and
 *         appropriate error is set
 */
//==============================================================================
//static ssize_t I2C_receive(I2C_dev_t *hdl, u8_t *dst, size_t size, bool stop)
//{
//        struct I2C_per *per = &I2C->periph[hdl->config->major];
//
//        per->data          = dst;
//        per->data_size     = size;
//        per->stop          = stop;
//        per->write         = false;
//        per->sub_addr      = 0;
//        per->sub_addr_mode = I2C_SUB_ADDR_MODE__DISABLED;
//        per->dev           = hdl;
//        per->state         = STATE_START;
//
//        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);
//
//        return wait_for_event(hdl) ? static_cast(ssize_t, size - per->data_size) : -1;
//}

//==============================================================================
/**
 * @brief  Event IRQ handler (transaction state machine)
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static void IRQ_EV_handler(u8_t major)
{
        GPIO_SET_PIN(PB15); // TEST
        if (I2C1->SR1 & I2C->periph[major].SR1_mask) {
                _sys_semaphore_signal_from_ISR(I2C->periph[major].event, NULL);
                CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
                I2C->periph[major].IRQ_cnt = 0;
        } else {
                /*
                 * This counter is used to check if there is no death loop of
                 * not handled IRQ. If counter reach specified value then
                 * the error flag is set.
                 */
                if (++I2C->periph[major].IRQ_cnt >= 100) {
                        I2C->periph[major].error = true;
                        _sys_semaphore_signal_from_ISR(I2C->periph[major].event, NULL);
                        CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
                }
        }
        GPIO_CLEAR_PIN(PB15); // TEST
}

//==============================================================================
/**
 * @brief  Error IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static void IRQ_ER_handler(u8_t major)
{
        I2C->periph[major].error = true;
        _sys_semaphore_signal_from_ISR(I2C->periph[major].event, NULL);
        CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
}

//==============================================================================
/**
 * @brief  DMA IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
//#if (_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0)
//static bool IRQ_DMA_handler(u8_t major)
//{
//        bool            woken = false;
//        I2C_config_t   *cfg   = const_cast(I2C_config_t*, &I2C_cfg[major]);
//        I2C_t          *i2c   = const_cast(I2C_t*, cfg->I2C);
//        struct I2C_per *per   = &I2C->periph[major];
//        int             txno  = cfg->DMA_tx_number - 1;
//        int             rxno  = cfg->DMA_rx_number - 1;
//
//        if (DMA1->ISR & ((DMA_ISR_TCIF1 << (4 * txno)) | (DMA_ISR_TCIF1 << (4 * rxno)))) {
//
//                per->data_size = 0;
//                per->addr10rd  = false;
//                per->state     = STATE_IDLE;
//
//                if (per->stop)
//                        SET_BIT(i2c->CR1, I2C_CR1_STOP);
//
//                _sys_semaphore_signal_from_ISR(I2C->periph[major].event, &woken);
//
//        } else if (DMA1->ISR & ((DMA_ISR_TEIF1 << (4 * txno)) | (DMA_ISR_TEIF1 << (4 * rxno)))) {
//                woken = IRQ_ER_handler(major);
//        }
//
//        clear_DMA_IRQ_flags(major);
//
//        return woken;
//}
//#endif

//==============================================================================
/**
 * @brief  I2C1 Event IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C1);
        _sys_task_yield_from_ISR();
}
#endif

//==============================================================================
/**
 * @brief  I2C1 Error IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C1);
        _sys_task_yield_from_ISR();
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Event IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_EV_IRQHandler(void)
{
        IRQ_EV_handler(_I2C2);
        _sys_task_yield_from_ISR();
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Error IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_ER_IRQHandler(void)
{
        IRQ_ER_handler(_I2C2);
        _sys_task_yield_from_ISR();
}
#endif

//==============================================================================
/**
 * @brief  I2C1 DMA Tx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel6_IRQHandler(void)
{
//        if (IRQ_DMA_handler(_I2C1)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

//==============================================================================
/**
 * @brief  I2C1 DMA Rx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel7_IRQHandler(void)
{
//        if (IRQ_DMA_handler(_I2C1)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

//==============================================================================
/**
 * @brief  I2C2 DMA Tx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel4_IRQHandler(void)
{
//        if (IRQ_DMA_handler(_I2C2)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

//==============================================================================
/**
 * @brief  I2C2 DMA Rx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel5_IRQHandler(void)
{
//        if (IRQ_DMA_handler(_I2C2)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
